{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },

  "Software": [
    ".Net Blazor",
    ".Net MAUI",
    "MudBlazor",
    "Telerik",
    "Microsoft SQL Server",
    "Visual Studio",
    "GitHub",
    "Microsoft Office 365"
  ],

  "Languages": [
    "C#",
    "C++",
    "Python",
    "CSS",
    "HTML",
    "MySQL",
    "JavaScript",
    "PHP",
    "Visual Basic",
    "BASH"
  ],

  "Language_Description": [
    "Primary Language - Used for coding back-end support for all of my Blazor Projects.  Used for Web Pages to create online interfaces for managers at Morris & Dickson and create automated programs that query SQL, compile data, and format them into weekly and daily reports for DSCSA & Compliance staff",
    "Language used when completing projects and assignments for my undergraduate course at Louisiana State University",
    "Language used partially for assignments during my time as a student and as a Teaching Assistant and Research Assistant at NYU and LSU respectively",
    "Primary Language - Used for coding front-end web pages for Morris & Dickson's Blazor Projects",
    "Used to assist in creating visual elements to improve UI design and readability for my Blazor Projects",
    "Primary Language - Used for handling the back-end databases along with my Blazor projects.  Used SQL to create Tables, Stored Procedures, Triggers, and Custom Data Types that help in optimizing and sorting out daily and weekly PO reports and Box Orders",
    "Used for my own Blazor Projects whenever there is a particular element that requires immediate user response as Blazor is primarily a statically design type of web page",
    "Minor Usage - Used only during my university assignments in NYU to create back-end code that allows a basic HTML web page to query SQL",
    "Minor Usage - To help a manager review employee punctuality, used Visual Basic to create Excel Macros to bypass certain restrictions that arise from the transition from Microsoft Excel -> Excel 365",
    "Used during my work as a Research Assistant and Teaching Assistant at LSU and NYU.  Created UNIX scripts that would automate the process of executing and reviewing coding projects from students for NYU.  Used to conduct trials & experiments to observe the behavior of Rasperry Pi devices when operating Database Management Software"
  ],

  "AllowedHosts": "*"
}